---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SlantedColumnGeometryTreatmentBase
source: html/dc795ee7-2bfd-41bc-5b12-a66026ba5f5f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SlantedColumnGeometryTreatmentBase Property

"Base Geometry Alignment"

## Syntax (C#)
```csharp
public static ForgeTypeId SlantedColumnGeometryTreatmentBase { get; }
```